MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS805/mcu.h
#define RPINR7 RPINR7
extern volatile uint16_t RPINR7 __attribute__((__sfr__));
typedef struct tagRPINR7BITS {
  uint16_t IC1R:8;
  uint16_t IC2R:8;
} RPINR7BITS;
extern volatile RPINR7BITS RPINR7bits __attribute__((__sfr__));

#define RPINR8 RPINR8
extern volatile uint16_t RPINR8 __attribute__((__sfr__));
typedef struct tagRPINR8BITS {
  uint16_t IC3R:8;
  uint16_t IC4R:8;
} RPINR8BITS;
extern volatile RPINR8BITS RPINR8bits __attribute__((__sfr__));

#define RPINR11 RPINR11
extern volatile uint16_t RPINR11 __attribute__((__sfr__));
typedef struct tagRPINR11BITS {
  uint16_t OCFAR:8;
} RPINR11BITS;
extern volatile RPINR11BITS RPINR11bits __attribute__((__sfr__));

#define RPINR12 RPINR12
extern volatile uint16_t RPINR12 __attribute__((__sfr__));
typedef struct tagRPINR12BITS {
  uint16_t FLT1R:8;
  uint16_t FLT2R:8;
} RPINR12BITS;
extern volatile RPINR12BITS RPINR12bits __attribute__((__sfr__));

#define RPINR13 RPINR13
extern volatile uint16_t RPINR13 __attribute__((__sfr__));
typedef struct tagRPINR13BITS {
  uint16_t FLT3R:8;
  uint16_t FLT4R:8;
} RPINR13BITS;
extern volatile RPINR13BITS RPINR13bits __attribute__((__sfr__));

#define RPINR18 RPINR18
extern volatile uint16_t RPINR18 __attribute__((__sfr__));
typedef struct tagRPINR18BITS {
  uint16_t U1RXR:8;
  uint16_t U1CTSR:8;
} RPINR18BITS;
extern volatile RPINR18BITS RPINR18bits __attribute__((__sfr__));

#define RPINR19 RPINR19
extern volatile uint16_t RPINR19 __attribute__((__sfr__));
typedef struct tagRPINR19BITS {
  uint16_t U2RXR:8;
  uint16_t U2CTSR:8;
} RPINR19BITS;
extern volatile RPINR19BITS RPINR19bits __attribute__((__sfr__));

#define RPINR20 RPINR20
extern volatile uint16_t RPINR20 __attribute__((__sfr__));
typedef struct tagRPINR20BITS {
  uint16_t SDI1R:8;
  uint16_t SCK1INR:8;
} RPINR20BITS;
extern volatile RPINR20BITS RPINR20bits __attribute__((__sfr__));

#define RPINR21 RPINR21
extern volatile uint16_t RPINR21 __attribute__((__sfr__));
typedef struct tagRPINR21BITS {
  uint16_t SS1INR:8;
} RPINR21BITS;
extern volatile RPINR21BITS RPINR21bits __attribute__((__sfr__));

#define RPINR22 RPINR22
extern volatile uint16_t RPINR22 __attribute__((__sfr__));
typedef struct tagRPINR22BITS {
  uint16_t SDI2R:8;
  uint16_t SCK2INR:8;
} RPINR22BITS;
extern volatile RPINR22BITS RPINR22bits __attribute__((__sfr__));

#define RPINR23 RPINR23
extern volatile uint16_t RPINR23 __attribute__((__sfr__));
typedef struct tagRPINR23BITS {
  uint16_t SS2INR:8;
} RPINR23BITS;
extern volatile RPINR23BITS RPINR23bits __attribute__((__sfr__));

#define RPINR26 RPINR26
extern volatile uint16_t RPINR26 __attribute__((__sfr__));
typedef struct tagRPINR26BITS {
  uint16_t C1RXR:8;
  uint16_t C2RXR:8;
} RPINR26BITS;
extern volatile RPINR26BITS RPINR26bits __attribute__((__sfr__));

#define RPINR29 RPINR29
extern volatile uint16_t RPINR29 __attribute__((__sfr__));
typedef struct tagRPINR29BITS {
  uint16_t SDI3R:8;
  uint16_t SCK3INR:8;
} RPINR29BITS;
extern volatile RPINR29BITS RPINR29bits __attribute__((__sfr__));

#define RPINR30 RPINR30
extern volatile uint16_t RPINR30 __attribute__((__sfr__));
typedef struct tagRPINR30BITS {
  uint16_t SS3INR:8;
} RPINR30BITS;
extern volatile RPINR30BITS RPINR30bits __attribute__((__sfr__));

#define RPINR37 RPINR37
extern volatile uint16_t RPINR37 __attribute__((__sfr__));
typedef struct tagRPINR37BITS {
  uint16_t :8;
  uint16_t PSYNCI1R:8;
} RPINR37BITS;
extern volatile RPINR37BITS RPINR37bits __attribute__((__sfr__));

#define RPINR38 RPINR38
extern volatile uint16_t RPINR38 __attribute__((__sfr__));
typedef struct tagRPINR38BITS {
  uint16_t PSYNCI2R:8;
} RPINR38BITS;
extern volatile RPINR38BITS RPINR38bits __attribute__((__sfr__));

#define RPINR42 RPINR42
extern volatile uint16_t RPINR42 __attribute__((__sfr__));
typedef struct tagRPINR42BITS {
  uint16_t FLT5R:8;
  uint16_t FLT6R:8;
} RPINR42BITS;
extern volatile RPINR42BITS RPINR42bits __attribute__((__sfr__));

#define RPINR43 RPINR43
extern volatile uint16_t RPINR43 __attribute__((__sfr__));
typedef struct tagRPINR43BITS {
  uint16_t FLT7R:8;
  uint16_t FLT8R:8;
} RPINR43BITS;
extern volatile RPINR43BITS RPINR43bits __attribute__((__sfr__));

#define RPINR45 RPINR45
extern volatile uint16_t RPINR45 __attribute__((__sfr__));
typedef struct tagRPINR45BITS {
  uint16_t :8;
  uint16_t CLCINAR:8;
} RPINR45BITS;
extern volatile RPINR45BITS RPINR45bits __attribute__((__sfr__));

#define RPINR46 RPINR46
extern volatile uint16_t RPINR46 __attribute__((__sfr__));
typedef struct tagRPINR46BITS {
  uint16_t CLCINBR:8;
} RPINR46BITS;
extern volatile RPINR46BITS RPINR46bits __attribute__((__sfr__));

#define NVMCON NVMCON
extern volatile uint16_t NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      uint16_t NVMOP:4;
      uint16_t :4;
      uint16_t URERR:1;
      uint16_t RPDF:1;
      uint16_t P2ACTIV:1;
      uint16_t SFTSWP:1;
      uint16_t NVMSIDL:1;
      uint16_t WRERR:1;
      uint16_t WREN:1;
      uint16_t WR:1;
    };
    struct {
      uint16_t NVMOP0:1;
      uint16_t NVMOP1:1;
      uint16_t NVMOP2:1;
      uint16_t NVMOP3:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMADR NVMADR
extern volatile uint16_t NVMADR __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t NVMADRL:15;
    };
    struct {
      uint16_t :1;
      uint16_t NVMADR:15;
    };
  };
} NVMADRBITS;
extern volatile NVMADRBITS NVMADRbits __attribute__((__sfr__));

#define NVMADRL NVMADRL
extern volatile uint16_t NVMADRL __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRLBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t NVMADRL:15;
    };
    struct {
      uint16_t :1;
      uint16_t NVMADR:15;
    };
  };
} NVMADRLBITS;
extern volatile NVMADRLBITS NVMADRLbits __attribute__((__sfr__));

#define NVMADRH NVMADRH
extern volatile uint16_t NVMADRH __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRHBITS {
  union {
    struct {
      uint16_t NVMADRH:8;
    };
    struct {
      uint16_t NVMADRU:8;
    };
  };
} NVMADRHBITS;
extern volatile NVMADRHBITS NVMADRHbits __attribute__((__sfr__));

#define NVMADRU NVMADRU
extern volatile uint16_t NVMADRU __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRUBITS {
  union {
    struct {
      uint16_t NVMADRH:8;
    };
    struct {
      uint16_t NVMADRU:8;
    };
  };
} NVMADRUBITS;
