MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS805/mcu.h
/* RPOR1 */
#define _RP18R RPOR1bits.RP18R
#define _RP19R RPOR1bits.RP19R

/* RPOR2 */
#define _RP20R RPOR2bits.RP20R
#define _RP32R RPOR2bits.RP32R

/* RPOR3 */
#define _RP33R RPOR3bits.RP33R
#define _RP34R RPOR3bits.RP34R

/* RPOR4 */
#define _RP35R RPOR4bits.RP35R
#define _RP36R RPOR4bits.RP36R

/* RPOR5 */
#define _RP37R RPOR5bits.RP37R
#define _RP38R RPOR5bits.RP38R

/* RPOR6 */
#define _RP39R RPOR6bits.RP39R
#define _RP40R RPOR6bits.RP40R

/* RPOR7 */
#define _RP41R RPOR7bits.RP41R
#define _RP43R RPOR7bits.RP43R

/* RPOR8 */
#define _RP44R RPOR8bits.RP44R
#define _RP45R RPOR8bits.RP45R

/* RPOR9 */
#define _RP46R RPOR9bits.RP46R
#define _RP47R RPOR9bits.RP47R

/* RPOR10 */
#define _RP48R RPOR10bits.RP48R
#define _RP49R RPOR10bits.RP49R

/* RPOR11 */
#define _RP50R RPOR11bits.RP50R
#define _RP51R RPOR11bits.RP51R

/* RPOR12 */
#define _RP52R RPOR12bits.RP52R
#define _RP53R RPOR12bits.RP53R

/* RPOR13 */
#define _RP54R RPOR13bits.RP54R
#define _RP55R RPOR13bits.RP55R

/* RPOR14 */
#define _RP56R RPOR14bits.RP56R
#define _RP57R RPOR14bits.RP57R

/* RPOR15 */
#define _RP58R RPOR15bits.RP58R
#define _RP60R RPOR15bits.RP60R

/* RPOR16 */
#define _RP61R RPOR16bits.RP61R
#define _RP62R RPOR16bits.RP62R

/* RPOR17 */
#define _RP63R RPOR17bits.RP63R
#define _RP64R RPOR17bits.RP64R

/* RPOR18 */
#define _RP65R RPOR18bits.RP65R
#define _RP66R RPOR18bits.RP66R

/* RPOR19 */
#define _RP67R RPOR19bits.RP67R
#define _RP68R RPOR19bits.RP68R

/* RPOR20 */
#define _RP69R RPOR20bits.RP69R
#define _RP70R RPOR20bits.RP70R

/* RPOR21 */
#define _RP71R RPOR21bits.RP71R
#define _RP72R RPOR21bits.RP72R

/* RPOR22 */
#define _RP73R RPOR22bits.RP73R
#define _RP74R RPOR22bits.RP74R

/* RPOR23 */
#define _RP75R RPOR23bits.RP75R
#define _RP76R RPOR23bits.RP76R

/* RPOR24 */
#define _RP176R RPOR24bits.RP176R
#define _RP177R RPOR24bits.RP177R

/* RPOR25 */
#define _RP178R RPOR25bits.RP178R
#define _RP179R RPOR25bits.RP179R

/* RPOR26 */
#define _RP180R RPOR26bits.RP180R
#define _RP181R RPOR26bits.RP181R

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R

/* RPINR2 */
#define _T1CKR RPINR2bits.T1CKR

/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T3CKR RPINR3bits.T3CKR

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC2R RPINR7bits.IC2R

/* RPINR8 */
#define _IC3R RPINR8bits.IC3R
#define _IC4R RPINR8bits.IC4R

/* RPINR11 */
#define _OCFAR RPINR11bits.OCFAR

/* RPINR12 */
#define _FLT1R RPINR12bits.FLT1R
#define _FLT2R RPINR12bits.FLT2R

/* RPINR13 */
#define _FLT3R RPINR13bits.FLT3R
#define _FLT4R RPINR13bits.FLT4R

/* RPINR18 */
#define _U1RXR RPINR18bits.U1RXR
#define _U1CTSR RPINR18bits.U1CTSR

/* RPINR19 */
#define _U2RXR RPINR19bits.U2RXR
#define _U2CTSR RPINR19bits.U2CTSR

/* RPINR20 */
#define _SDI1R RPINR20bits.SDI1R
#define _SCK1INR RPINR20bits.SCK1INR

/* RPINR21 */
#define _SS1INR RPINR21bits.SS1INR

/* RPINR22 */
#define _SDI2R RPINR22bits.SDI2R
#define _SCK2INR RPINR22bits.SCK2INR

/* RPINR23 */
#define _SS2INR RPINR23bits.SS2INR

/* RPINR26 */
#define _C1RXR RPINR26bits.C1RXR
#define _C2RXR RPINR26bits.C2RXR

/* RPINR29 */
#define _SDI3R RPINR29bits.SDI3R
#define _SCK3INR RPINR29bits.SCK3INR

/* RPINR30 */
#define _SS3INR RPINR30bits.SS3INR

/* RPINR37 */
#define _PSYNCI1R RPINR37bits.PSYNCI1R

/* RPINR38 */
#define _PSYNCI2R RPINR38bits.PSYNCI2R

/* RPINR42 */
#define _FLT5R RPINR42bits.FLT5R
#define _FLT6R RPINR42bits.FLT6R

/* RPINR43 */
#define _FLT7R RPINR43bits.FLT7R
#define _FLT8R RPINR43bits.FLT8R

/* RPINR45 */
#define _CLCINAR RPINR45bits.CLCINAR

/* RPINR46 */
#define _CLCINBR RPINR46bits.CLCINBR

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _URERR NVMCONbits.URERR
#define _RPDF NVMCONbits.RPDF
#define _P2ACTIV NVMCONbits.P2ACTIV
#define _SFTSWP NVMCONbits.SFTSWP
#define _NVMSIDL NVMCONbits.NVMSIDL
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3

/* NVMADR */
#define _NVMADRL NVMADRbits.NVMADRL
#define _NVMADR NVMADRbits.NVMADR

/* NVMADRH */
#define _NVMADRH NVMADRHbits.NVMADRH
#define _NVMADRU NVMADRHbits.NVMADRU

/* NVMSRCADDR */
#define _NVMSRCADRL NVMSRCADDRbits.NVMSRCADRL

/* NVMSRCADRH */
#define _NVMSRCADRH NVMSRCADRHbits.NVMSRCADRH

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
#define _CM RCONbits.CM
#define _VREGSF RCONbits.VREGSF
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLPRE CLKDIVbits.PLLPRE
#define _PLLPOST CLKDIVbits.PLLPOST
#define _FRCDIV CLKDIVbits.FRCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _PLLPRE0 CLKDIVbits.PLLPRE0
#define _PLLPRE1 CLKDIVbits.PLLPRE1
#define _PLLPRE2 CLKDIVbits.PLLPRE2
#define _PLLPRE3 CLKDIVbits.PLLPRE3
#define _PLLPRE4 CLKDIVbits.PLLPRE4
#define _PLLPOST0 CLKDIVbits.PLLPOST0
#define _PLLPOST1 CLKDIVbits.PLLPOST1
#define _FRCDIV0 CLKDIVbits.FRCDIV0
#define _FRCDIV1 CLKDIVbits.FRCDIV1
#define _FRCDIV2 CLKDIVbits.FRCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* PLLFBD */
#define _PLLDIV PLLFBDbits.PLLDIV
#define _PLLDIV0 PLLFBDbits.PLLDIV0
#define _PLLDIV1 PLLFBDbits.PLLDIV1
#define _PLLDIV2 PLLFBDbits.PLLDIV2
#define _PLLDIV3 PLLFBDbits.PLLDIV3
#define _PLLDIV4 PLLFBDbits.PLLDIV4
#define _PLLDIV5 PLLFBDbits.PLLDIV5
#define _PLLDIV6 PLLFBDbits.PLLDIV6
#define _PLLDIV7 PLLFBDbits.PLLDIV7
#define _PLLDIV8 PLLFBDbits.PLLDIV8

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TUN4 OSCTUNbits.TUN4
#define _TUN5 OSCTUNbits.TUN5

/* LFSR */
#define _LFSR LFSRbits.LFSR

/* REFOCON */
#define _RODIV REFOCONbits.RODIV
#define _ROSEL REFOCONbits.ROSEL
#define _ROSSLP REFOCONbits.ROSSLP
#define _ROON REFOCONbits.ROON
#define _RODIV0 REFOCONbits.RODIV0
#define _RODIV1 REFOCONbits.RODIV1
#define _RODIV2 REFOCONbits.RODIV2
#define _RODIV3 REFOCONbits.RODIV3

