MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS805/mcu.h
#define _PWMCON6_FLTIEN_POSITION                 0x0000000C
#define _PWMCON6_FLTIEN_MASK                     0x00001000
#define _PWMCON6_FLTIEN_LENGTH                   0x00000001

#define _PWMCON6_TRGSTAT_POSITION                0x0000000D
#define _PWMCON6_TRGSTAT_MASK                    0x00002000
#define _PWMCON6_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON6_CLSTAT_POSITION                 0x0000000E
#define _PWMCON6_CLSTAT_MASK                     0x00004000
#define _PWMCON6_CLSTAT_LENGTH                   0x00000001

#define _PWMCON6_FLTSTAT_POSITION                0x0000000F
#define _PWMCON6_FLTSTAT_MASK                    0x00008000
#define _PWMCON6_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON6_DTC0_POSITION                   0x00000006
#define _PWMCON6_DTC0_MASK                       0x00000040
#define _PWMCON6_DTC0_LENGTH                     0x00000001

#define _PWMCON6_DTC1_POSITION                   0x00000007
#define _PWMCON6_DTC1_MASK                       0x00000080
#define _PWMCON6_DTC1_LENGTH                     0x00000001

#define _IOCON6_OSYNC_POSITION                   0x00000000
#define _IOCON6_OSYNC_MASK                       0x00000001
#define _IOCON6_OSYNC_LENGTH                     0x00000001

#define _IOCON6_SWAP_POSITION                    0x00000001
#define _IOCON6_SWAP_MASK                        0x00000002
#define _IOCON6_SWAP_LENGTH                      0x00000001

#define _IOCON6_CLDAT_POSITION                   0x00000002
#define _IOCON6_CLDAT_MASK                       0x0000000C
#define _IOCON6_CLDAT_LENGTH                     0x00000002

#define _IOCON6_FLTDAT_POSITION                  0x00000004
#define _IOCON6_FLTDAT_MASK                      0x00000030
#define _IOCON6_FLTDAT_LENGTH                    0x00000002

#define _IOCON6_OVRDAT_POSITION                  0x00000006
#define _IOCON6_OVRDAT_MASK                      0x000000C0
#define _IOCON6_OVRDAT_LENGTH                    0x00000002

#define _IOCON6_OVRENL_POSITION                  0x00000008
#define _IOCON6_OVRENL_MASK                      0x00000100
#define _IOCON6_OVRENL_LENGTH                    0x00000001

#define _IOCON6_OVRENH_POSITION                  0x00000009
#define _IOCON6_OVRENH_MASK                      0x00000200
#define _IOCON6_OVRENH_LENGTH                    0x00000001

#define _IOCON6_PMOD_POSITION                    0x0000000A
#define _IOCON6_PMOD_MASK                        0x00000C00
#define _IOCON6_PMOD_LENGTH                      0x00000002

#define _IOCON6_POLL_POSITION                    0x0000000C
#define _IOCON6_POLL_MASK                        0x00001000
#define _IOCON6_POLL_LENGTH                      0x00000001

#define _IOCON6_POLH_POSITION                    0x0000000D
#define _IOCON6_POLH_MASK                        0x00002000
#define _IOCON6_POLH_LENGTH                      0x00000001

#define _IOCON6_PENL_POSITION                    0x0000000E
#define _IOCON6_PENL_MASK                        0x00004000
#define _IOCON6_PENL_LENGTH                      0x00000001

#define _IOCON6_PENH_POSITION                    0x0000000F
#define _IOCON6_PENH_MASK                        0x00008000
#define _IOCON6_PENH_LENGTH                      0x00000001

#define _IOCON6_CLDAT0_POSITION                  0x00000002
#define _IOCON6_CLDAT0_MASK                      0x00000004
#define _IOCON6_CLDAT0_LENGTH                    0x00000001

#define _IOCON6_CLDAT1_POSITION                  0x00000003
#define _IOCON6_CLDAT1_MASK                      0x00000008
#define _IOCON6_CLDAT1_LENGTH                    0x00000001

#define _IOCON6_FLTDAT0_POSITION                 0x00000004
#define _IOCON6_FLTDAT0_MASK                     0x00000010
#define _IOCON6_FLTDAT0_LENGTH                   0x00000001

#define _IOCON6_FLTDAT1_POSITION                 0x00000005
#define _IOCON6_FLTDAT1_MASK                     0x00000020
#define _IOCON6_FLTDAT1_LENGTH                   0x00000001

#define _IOCON6_OVRDAT0_POSITION                 0x00000006
#define _IOCON6_OVRDAT0_MASK                     0x00000040
#define _IOCON6_OVRDAT0_LENGTH                   0x00000001

#define _IOCON6_OVRDAT1_POSITION                 0x00000007
#define _IOCON6_OVRDAT1_MASK                     0x00000080
#define _IOCON6_OVRDAT1_LENGTH                   0x00000001

#define _IOCON6_PMOD0_POSITION                   0x0000000A
#define _IOCON6_PMOD0_MASK                       0x00000400
#define _IOCON6_PMOD0_LENGTH                     0x00000001

#define _IOCON6_PMOD1_POSITION                   0x0000000B
#define _IOCON6_PMOD1_MASK                       0x00000800
#define _IOCON6_PMOD1_LENGTH                     0x00000001

#define _FCLCON6_FLTMOD_POSITION                 0x00000000
#define _FCLCON6_FLTMOD_MASK                     0x00000003
#define _FCLCON6_FLTMOD_LENGTH                   0x00000002

#define _FCLCON6_FLTPOL_POSITION                 0x00000002
#define _FCLCON6_FLTPOL_MASK                     0x00000004
#define _FCLCON6_FLTPOL_LENGTH                   0x00000001

#define _FCLCON6_FLTSRC_POSITION                 0x00000003
#define _FCLCON6_FLTSRC_MASK                     0x000000F8
#define _FCLCON6_FLTSRC_LENGTH                   0x00000005

#define _FCLCON6_CLMOD_POSITION                  0x00000008
#define _FCLCON6_CLMOD_MASK                      0x00000100
#define _FCLCON6_CLMOD_LENGTH                    0x00000001

#define _FCLCON6_CLPOL_POSITION                  0x00000009
#define _FCLCON6_CLPOL_MASK                      0x00000200
#define _FCLCON6_CLPOL_LENGTH                    0x00000001

#define _FCLCON6_CLSRC_POSITION                  0x0000000A
#define _FCLCON6_CLSRC_MASK                      0x00007C00
#define _FCLCON6_CLSRC_LENGTH                    0x00000005

#define _FCLCON6_IFLTMOD_POSITION                0x0000000F
#define _FCLCON6_IFLTMOD_MASK                    0x00008000
#define _FCLCON6_IFLTMOD_LENGTH                  0x00000001

#define _FCLCON6_FLTMOD0_POSITION                0x00000000
#define _FCLCON6_FLTMOD0_MASK                    0x00000001
#define _FCLCON6_FLTMOD0_LENGTH                  0x00000001

